''' Задачка про мігічний проміжок чисел:
Як ви знаєте оператор *is* грубокажучи робить перевірку id(variable1) == id(variable2)
І в Пайтоні щоб пришвидшити його роботу створюється певний проміжок чисел Вам потрібно знайти той проміжок
Приклад 
a=42
b=42
a *is* b #  True

c=99999999999999999999999999999999999999
d=99999999999999999999999999999999999999

c *is* d #  False 
'''

def audit(x,y):   
    a = x
    b = y
    while True:             # від початкової точки а=0 та b=0 додаємо 1 доки не отримаємо False
        if a is b:
            a += 1
            b += 1
        else:
            end = a
            break
    a = x
    b = y
    while True:             # від початкової точки а=0 та b=0 віднімаємо 1 поки не отримаємо False
        if a is b:
            a -= 1
            b -= 1
        else:
            start = a
            break
    return "start = {} and end = {}".format(start,end)


print(audit(0,0))