'''Задача №7
Написати програму, яка перевіряє закріти всі круглі дужки у виразі
*Вхідні дані:* алгебраїчний вираз. Передається в програму як аргумент командного рядка.

*Результат роботи:* True or False

Наприклад
Вхідні дані: (a-2)*(sqrt(4x)-6)**2 (маю на увазі будь-який вираз, довільний)
Приклад виклику: python lab.py (a-2)*(sqrt(4x)-6)**2
Результат: true
Вхідні дані: ()()((()()))
Приклад виклику: python lab.py ()()((()())))
Результат:  False
Вхідні дані: )(())(
Приклад виклику: python lab.py )(())(
Результат: False 
'''


import sys

s=list(sys.argv[1:])

def check(s):
    l = []
    for i in s[0]:                  # Витягуємо дужки із формули
        if i == "(" or i == ")":
            l.append(i)
        else:
            continue

    if l.count("(") == l.count(")"):      # Перевіряємо к-ть відкритих і закритих дужок
        if l[0] == ")" or l[-1] == "(":   # Перевіряємо на відкритість і закритість,перші та останні дужки
            return False
        else:
            return True
    else:
        return False

print(check(s))        
 # ПРОГРАМА МАЄ ПОМИЛКУ ПРИ " () )( ()"
