'''Задача №5
*Розробити функцію count_holes(n)*, 
яка приймає 1 аргумент -- ціле число або рядок, який містить ціле число, 
та повертає ціле число -- кількість “отворів” у десятковому записі цього числа друкованими цифрами (вважати, що у “4" та у “0” по одному отвору), або рядок ERROR, якщо переданий аргумент не задовольняє вимогам: є дійсним або взагалі не числом.

Незначущими нулями на початку запису числа, якщо такі є, нехтувати.

*Наприклад*
Виклик функціїі: count_holes(‘123’)
Повертає: 0
*Виклик функціїі:* count_holes(906)
Повертає: 3
*Виклик функціїі:* count_holes(‘001’)
Повертає: 0
*Виклик функціїі:* count_holes(-8)
Повертає: 2
*Виклик функціїі:* count_holes(-8.0)
Повертає: ERROR
'''


def count_holes(n):
    if isinstance(n, float):                               	#перевіряє тип вхідних даних 
        return 'ERROR'
    try:
        answers = {'0': 1, '4': 1, '6': 1, '8': 2, '9': 1}
        con = 0
        n = int(n)
        n = str(n)
        for i in n:
            if i in answers:
                con += answers.get(i)
        return con
    except ValueError:
        return "ERROR"
    except TypeError:
        return "ERROR"

print(count_holes('81'))

# НЕ ЗРОБИВ!
#-Незначущими нулями на початку запису числа, якщо такі є, нехтувати.
