
print("Вітаю тебе з прибуттям в Зону Відчуження!!!\n")

name = input("Як тебе звати СТАЛКЕР?\n")
print( str(name) + "," + "cьогодні тебе чекає не легке випробування.\n"
        "Завдання: знайти сталкера на ім'я Спритник — він ніс флешку з інформацією, але його схопили бандити.\n")
flag = True
while flag:
    lv1 = input("Куди плануєш слідувати:\n"
                         "- 'Смітник'\n"
                         "- 'Темна долина'\n")
    if lv1 == "Смітник":
        print("При вході бачиш бандитів,які оточили сталкера.")

        flag2 = True
        while flag2:
            lv1_1 = input("Твої дії: ... ?\n"
                        "- 'Перестрілка'\n"
                        "- 'Обійти'\n")

            if lv1_1 == "Обійти":

                print("Не приділяючи уваги ти вирішив обійти їх, в наслідок чого получив пулю в  спину.\n"
                    "!!!___GAME_OVER___!!!")
                exit()


            elif lv1_1 == "Перестрілка":

                flag3 = True
                while flag3:
                    lv1_2 = input("Ти їх застрелив і спас сталкера\n "
                        "Але тебе поранено в ногу, куди будеш рухатись?:\n"
                    
                        "- 'В бар' - щоб полікуватись.\n"
                        "- 'В темну долину' - рана не сильна заживе сама.\n")

                    if lv1_2 == "В бар":
                        print("Ти відпочив і полікував поранення.\n"
                              "Також поспілкувавшись з барменом ти узнав,що група бандитів засіла в лабораторії X-16,\n"
                              "а це значить,що потрібно слідувати в Темну долину")
                        flag2 = False
                        break

                    elif lv1_2 == "В темну долину":
                        print("По дорозі ти зустрічаєш аномалію 'Електра'. В стороні якої видніється артефакт.\n")

                        while True:
                            lv1_3 = input("У тебе вибір: ... [вибери цифру]\n"
                                        "1) Межі аномалії добре видно, підійти і акуратно дістати артефакт.\n"
                                        "2) Кинути болти,щоб провірити межі, після цього наблизитись і забрати артефакт.\n")
                            if lv1_3 == "1":
                                print("Буквально за метер до артефакту появляється біла вспишка і гучний тріск понизує\n"
                                      "тебе розрядом струму. Не варто в Зоні полягатись на удачу...\n"
                                      "!!!___GAME_OVER___!!!\n")
                                exit()
                            elif lv1_3 == "2":
                                print("Старе поранення далося в знаки, на підході до артефакту нога підвернулася\n"
                                      "і гучний тріск пронизує тебе розрядом струму.\n"
                                      "!!!___GAME_OVER___!!!\n")
                                exit()
                            else:
                                continue
                    else:
                        continue
            else:
                continue

    elif lv1 == "Темна долина":
        print("По дорозі ти зустрічаєш аномалію 'Електра'. В стороні якої видніється артефакт.\n")

        while True:
            lv2 = input("У тебе вибір: ... [вибери цифру]\n"
              "1) Межі аномалії добре видно, підійти і акуратно дістати артефакт.\n"
              "2) Кинути болти,щоб провірити межі, після цього наблизитись і забрати артефакт.\n"
              "3) На даний час є справи важливіші,не варто тратити час і сили, краще піду дальше.\n")

            if lv2 == "1":
                print("Буквально за метер до артефакту появляється біла вспишка і гучний тріск понизує\n"
                      "тебе розрядом струму. Не варто в Зоні полягатись на удачу...\n"
                      "!!!___GAME_OVER___!!!\n")
                exit()

            elif lv2 == "2":
                print("Тобі удалось здобути артефакт. І ти продовжив свій рух дальше.\n"
                      "Твоя дорога завела тебе до входу в секретну лабораторію X-16.\n"
                      "По слухам через неї якраз проходив Спритник.\n")


                while True:
                    lv2_1 = input("Великі металічні двері в лабораторію закриті із середини, твої дії? ... [вибери цифру]\n"
                              "1) Поєднати артефакт із гранатою, і використати для підриву дверей.\n"
                              "2) Обійти лабораторію, в пошуках другого входу.\n")
                    if lv2_1 == "1":
                        print("Бомба закладена, ти відходиш на безпечну відстань...\n")
                        lv2_6 = input("[Для детонації нажми клавішу Enter]")
                        print("3\n2\n1\n!!!_ВЗРИВ_!!!\n Ти повільно заходиш всередину, і в темноті коридорів чуєш рик мутанта,\n"
                              "його нізким не спутаєш, це кровосос!\n")

                        while True:
                            lv2_2 = input("Тут вибір не великий:\n"
                                          "'Автомат' - витягуєш свій любимий АК-74 і на пролом.\n"
                                          "'Дробовик' - старенький 'Чейзер-13' і 6 зарядів дробу, затишитись в куті та чекати  звіра.\n"
                                          "'Назад' - ніколи не пізно вернутись, і пошукати другий вхід в лабораторію.\n")
                            if lv2_2 == "Автомат":
                                print("АК-74 ще ніраз не підводив, але в темних лабіринтах лабораторії проти невидимого ворога\n"
                                      "він став не ефективним, черга пуль не зупинила кровососа, звір напав ззаді...\n"
                                      "!!!___GAME_OVER___!!!\n")
                                exit()
                            elif lv2_2 == "Дробовик":
                                print("Прикривши спину стіною, ти засів в куті. Мутант не заставив себе чекати,\n"
                                      "як тільки перед очима милькнув силует монста, 4 заряда дробу з грохотом влетіли\n"
                                      "в його тіло. Цього було достатньо щоб повалити тварюку на землю.\n")
                                while True:
                                    lv2_3 = input("Пробравшись в підвальне приміщення ти підходиш до кімнати, за дверима якої чуєш голоси бандитів\n"
                                                  "Твої дії: ... [вибери цифру]\n"
                                                  "1) Закинути гранату, після чого зайти в кімнату з АК-74 на поготові.\n"
                                                  "2) Вибити двері ногою, після чого почати перестрілку.\n")
                                    if lv2_3 == "1":
                                        print("Хлопок гранати, ти заходиш в кімнату яка повна диму і на землі тіла мертвих бандитів.\n"
                                              "Серед них ти знаходиш і тіло мертвого сталкера Спритника, флешки з інформацією ти так і не знайшов.\n"
                                              "!!!___GAME_OVER___!!!\n ")
                                        exit()
                                    elif lv2_3 == "2":
                                        print("В першу ж секунду ти помічаєш Спритника,який звязаний на колінах стоїть посеред кімнати.\n"
                                              "Ти влучно трьома короткими чергами положив всіх бандитів в кімнаті.\n"
                                              "Після чого визволив Спритника, який показав де захована флешка з даними....\n\n"
                                              "СТАЛКЕР" +" "+str(name.upper())+" "+"ВИ УСПІШНО ВИКОНАЛИ ЗАВДАННЯ !!!")
                                        exit()
                                    else:
                                        continue

                            elif lv2_2 == "Назад":
                                print("Обернутися до мутанта спиною було поганою ідеєю...\n"
                                      "Ти навіть не встиг розвернутись як його когті пялись в твою спину.\n"
                                    "!!!___GAME_OVER___!!!\n")
                                exit()
                            else:
                                continue

                    elif lv2_1 == "2":
                        print("В пошуках обходу ти натрапляєш на розтяжку... невеликий хлопок рознісся по Зоні і тебе не стало\n"
                              "!!!___GAME_OVER___!!!\n")
                        exit()
                    else:
                        continue

            elif lv2 == "3": # не взяв артефакт
                print("Ти продовжив свій рух дальше.\n"
                      "Дорога завела тебе до входу в секретну лабораторію X-16.\n"
                      "По слухам через неї якраз проходив Спритник.\n")

                while True:
                    lv2_3 = input("Великі металічні двері в лабораторію закриті із середини, твої дії? ... [вибери цифру]\n"
                                  "1) Скористатися гранатою, щоб попробувати взірвати замок на дверях.\n"
                                  "2) Обійти лабораторію, в пошуках другого входу.\n")
                    if lv2_3 == "1":
                        print("Граната закладена, ти зриваєш чеку і біжиш на безпечну відстань...\n"
                              "3\n2\n1\n!!!_ВЗРИВ_!!!\n"
                              "Взриву було не достатньо,щоб заподіяти шкоду дверям\n"
                              "Але на шум вже за декілька хвилин прибігла ціла стая Псевдо-собак...яких тобі не вдалось перемогти\n"
                              "!!!___GAME_OVER___!!!\n")
                        exit()
                    elif lv2_3 == "2":
                        print(
                            "В пошуках обходу ти натрапляєш на розтяжку... невеликий хлопок рознісся по Зоні і тебе не стало\n"
                            "!!!___GAME_OVER___!!!\n")
                        exit()
                    else:
                        continue

            else:
                continue
    else:
        continue


